Revit 2026 API

# StoneStoneBumpAmount Property

---

The property labeled "Amount" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string StoneBumpAmount { get; }
```
```vb
Public Shared ReadOnly Property StoneBumpAmount As String
	Get
```
```cpp
public:
static property String^ StoneBumpAmount {
	String^ get ();
}
```
```fsharp
static member StoneBumpAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Stone Class

Autodesk.Revit.DB.Visual Namespace